typedef unsigned int   uint;
typedef unsigned short ushort;
typedef unsigned char  uchar;
/*
虚拟地址： [ 10 位页目录索引 | 10 位页表索引 | 12 位页内偏移 ]

页目录：
+------------------------------+
| 页目录项 0 (指向页表 0) 
| 页目录项 1 (指向页表 1)
| ...                  
| 页目录项 i (指向页表 i) 
+------------------------------+

页表 i：
+------------------------------+
| 页表项 0 (指向物理页框 0) 
| 页表项 1 (指向物理页框 1) 
| ...                  
| 页表项 j (指向物理页框 j) 
+------------------------------+
*/
typedef uint pde_t;             // PDE(Page Directory Entry)